In [1]:
#Importing the required libraries
import numpy as np # linear algebra
import pandas as pd # data processing,I/O

### 1.Read the data set and replace dashes with 0 to make sure you can perform arithmetic operations on the data.

In [2]:
#However it was seen that the first row of the dataset is empty.
#Hence replacing the values of second row as labels(By default the header=0).
laliga=pd.read_csv('Laliga.csv',header=1)

In [3]:
#Reading the imported dataset
print (laliga)

    Pos              Team  Seasons Points GamesPlayed GamesWon GamesDrawn  \
0     1       Real Madrid       86   4385        2762     1647        552
1     2         Barcelona       86   4262        2762     1581        573
2     3   Atletico Madrid       80   3442        2614     1241        598
3     4          Valencia       82   3386        2664     1187        616
4     5   Athletic Bilbao       86   3368        2762     1209        633
..  ...               ...      ...    ...         ...      ...        ...
56   57             Xerez        1     34          38        8         10
57   58            Condal        1     22          30        7          8
58   59   Atletico Tetuan        1     19          30        7          5
59   60  Cultural Leonesa        1     14          30        5          4
60   61            Girona        1      -           -        -          -

   GamesLost GoalsFor GoalsAgainst Champion Runner-up Third Fourth Fifth  \
0        563     5947         3140       33        23     8      8     3
1        608     5900         3114       25        25    12     12     4
2        775     4534         3309       10         8    16      9     7
3        861     4398         3469        6         6    10     11    10
4        920     4631         3700        8         7    10      5     8
..       ...      ...          ...      ...       ...   ...    ...   ...
56        20       38           66        -         -     -      -     -
57        15       37           57        -         -     -      -     -
58        18       51           85        -         -     -      -     -
59        21       34           65        -         -     -      -     -
60         -        -            -        -         -     -      -     -

   Sixth   T    Debut Since/LastApp  BestPosition
0      4  79     1929          1929             1
1      6  83     1929          1929             1
2      6  56     1929       2002-03             1
3      7  50  1931-32       1987-88             1
4     10  49     1929          1929             1
..   ...  ..      ...           ...           ...
56     -   -  2009-10       2009-10            20
57     -   -  1956-57       1956-57            16
58     -   -  1951-52       1951-52            16
59     -   -  1955-56       1955-56            15
60     -   -  2017-18       2017-18             9

[61 rows x 20 columns]

In [4]:
#Checking datatypes of all columns
laliga.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61 entries, 0 to 60
Data columns (total 20 columns):
Pos              61 non-null int64
Team             61 non-null object
Seasons          61 non-null int64
Points           61 non-null object
GamesPlayed      61 non-null object
GamesWon         61 non-null object
GamesDrawn       61 non-null object
GamesLost        61 non-null object
GoalsFor         61 non-null object
GoalsAgainst     61 non-null object
Champion         61 non-null object
Runner-up        61 non-null object
Third            61 non-null object
Fourth           61 non-null object
Fifth            61 non-null object
Sixth            61 non-null object
T                61 non-null object
Debut            61 non-null object
Since/LastApp    61 non-null object
BestPosition     61 non-null int64
dtypes: int64(3), object(17)
memory usage: 9.7+ KB

In [5]:
#Checking the number of rows and columns after removing first empty row and replacing the second one as index.
laliga.shape

(61, 20)

In [6]:
#Checking the value counts in the dataset,which shows - occuring multiple times in each column
(laliga['Champion']).value_counts()

-     52
1      3
2      1
25     1
8      1
33     1
10     1
6      1
Name: Champion, dtype: int64

In [7]:
# Using replace() to replace values(-) given in the dataset with 0.
#Setting inplace at true keeps the change on the original dataset.
laliga.replace('-',0,inplace=True)

In [8]:
#Checking the value counts/unique values in column Champions for verification
laliga['Champion'].value_counts()

0     52
1      3
25     1
8      1
2      1
33     1
10     1
6      1
Name: Champion, dtype: int64

In [9]:
#The occurences of '-' are now showing as '0'
#Now applying arithmetic and statistical calculations to the columns where changes have been made:

In [10]:
# Checking Arithmatic operations.
# Convert the datatype into int while performing the operations.
# Addition of values in the 'Champion' and 'Runner-up' columns we get:
laliga.iloc[:,10].astype(int) + laliga.iloc[:,11].astype(int)

0     56
1     50
2     18
3     12
4     15
      ..
56     0
57     0
58     0
59     0
60     0
Length: 61, dtype: int32

In [11]:
#Substraction of the same 2 column values will give us:
laliga.iloc[:,10].astype(int) - laliga.iloc[:,11].astype(int)

0     10
1      0
2      2
3      0
4      1
      ..
56     0
57     0
58     0
59     0
60     0
Length: 61, dtype: int32

In [12]:
#Multiplication of the 2 columns yields below results:
laliga.iloc[:,10].astype(int) * laliga.iloc[:,11].astype(int)

0     759
1     625
2      80
3      36
4      56
     ...
56      0
57      0
58      0
59      0
60      0
Length: 61, dtype: int32

In [13]:
#Division might be a bit tricky as it gives infinite or NaN values,
#Hence we store it in a new variable called x and use numpy to replace infinte and NaN values with 0(along with inplace=true)
x = laliga.iloc[:,10].astype(int)/laliga.iloc[:,11].astype(int)
x.replace(np.inf, np.nan, inplace = True)
x.fillna(0,inplace = True)
print(x)

0     1.434783
1     1.000000
2     1.250000
3     1.000000
4     1.142857
        ...
56    0.000000
57    0.000000
58    0.000000
59    0.000000
60    0.000000
Length: 61, dtype: float64

In [14]:
#Statistical numeric operations
#Finding out the mean of 'Champion' column while assigning the values in it as int.
laliga.iloc[:,10].astype(int).mean()

1.4262295081967213

In [15]:
#calculating Variance of the column 'Runner-up'
laliga.iloc[:,11].astype(int).var()

20.61256830601096

In [16]:
#Note that the values look different from that visible on the dataset as replacing NaN or - with 0,
#will effect the overall average(mean) and Variance values considering the 0 as part of data.

### 2.Print all the teams which have started playing between 1930-1980.(Use “Debut” column)

In [17]:
#Using Series.str and slice the first 4 characters(To avoid values with ranges such as 1930-1931 etc.),
#Then cast to int and filter with Series.between that gives out boolean indexing:
laliga_debut = laliga[laliga['Debut'].astype(str).str[:4].astype(int).between(1930, 1980)]
#Storing these filtered values in a new sub-variable called laliga_debut.

In [18]:
#Getting the count of teams that made an debut between 1930 to 1980.
laliga_debut[['Team','Debut']].count()

Team     37
Debut    37
dtype: int64

In [19]:
#Display team names and their debut years that fall within above timeline(1930-1980).
laliga_debut[['Team','Debut']]

                   Team    Debut
3              Valencia  1931-32
5               Sevilla  1934-35
8              Zaragoza  1939-40
9            Real Betis  1932-33
10  Deportivo La Coruna  1941-42
11           Celta Vigo  1939-40
12           Valladolid  1948-49
14       Sporting Gijon  1944-45
15              Osasuna  1935-36
16               Malaga  1949-50
17               Oviedo  1933-34
18             Mallorca  1960-61
19           Las Palmas  1951-52
21              Granada  1941-42
22       Rayo Vallecano  1977-78
23                Elche  1959-60
25             Hercules  1935-36
26             Tenerife  1961-62
27               Murcia  1940-41
28               Alaves  1930-31
29              Levante  1963-64
30            Salamanca  1974-75
31             Sabadell  1943-44
32                Cadiz  1977-78
34            Castellon  1941-42
37              Cordoba  1962-63
39           Recreativo  1978-79
40            Burgos CF  1971-72
41           Pontevedra  1963-64
46            Gimnastic  1947-48
49             Alcoyano  1945-46
50                 Jaen  1953-54
52           AD Almeria  1979-80
54               Lleida  1950-51
57               Condal  1956-57
58      Atletico Tetuan  1951-52
59     Cultural Leonesa  1955-56

### 3.Print the list of teams which came Top 5 in terms of points

In [20]:
# For using sort_values() function changing the datatype from str to int.
laliga['Points'] = laliga['Points'].astype(int)

In [21]:
# Giving "ascending = False" for arranging the dataset in descending order of points.
# Using head() function passing 5 as argument to display top 5 records.
laliga[['Points','Team']].sort_values(by = 'Points',ascending = False).head(5)

   Points             Team
0    4385      Real Madrid
1    4262        Barcelona
2    3442  Atletico Madrid
3    3386         Valencia
4    3368  Athletic Bilbao

### 4. Write a function with name “Goal_diff_count” which should return all the teams with their Goal Differences. Using the same function, find the team which has maximum and minimum goal difference.

Goal_diff_count = GoalsFor - GoalsAgainst

In [22]:
#Creating a new function with a name 'Goal_diff_count' that takes a given dataframe(df) as input argument:
def Goal_diff_count(df):   
     df['Goal_diff_count'] = df['GoalsFor'].astype(int)-df['GoalsAgainst'].astype(int)
     return df[['Team','Goal_diff_count']].sort_values(by = 'Goal_diff_count',ascending=False)
#As the output of above function are the columns named 'Team' and 'Goal_diff_count' sorted in descending order.

In [23]:
#Running the function with laliga as the argument dataframe:
Goal_diff_count(laliga)

                Team  Goal_diff_count
0        Real Madrid             2807
1          Barcelona             2786
2    Atletico Madrid             1225
4    Athletic Bilbao              931
3           Valencia              929
..               ...              ...
27            Murcia             -385
19        Las Palmas             -399
14    Sporting Gijon             -399
12        Valladolid             -413
13  Racing Santander             -525

[61 rows x 2 columns]

In [24]:
#To get the team with maximum value using the function:
Goal_diff_count(laliga).head(1)

          Team  Goal_diff_count
0  Real Madrid             2807

In [25]:
#To get the team name with minimum value using above created function:
Goal_diff_count(laliga).tail(1)

                Team  Goal_diff_count
13  Racing Santander             -525

### 5.Create a new column with the name “Winning Percent” and append it to the data set

Percentage of Winning = (GamesWon / GamesPlayed)*100
If there are any numerical error, replace it with 0%
Print the top 5 teams which have the highest Winning percentage

In [26]:
#Creating a new column with name 'winning percent' that is derived from values of other 2 columns.
#Also using astype(int) to convert the values of 'GamesWon' and 'GamesPlayed' to int(were object datatype by default).
laliga['Winning Percent']=(laliga['GamesWon'].astype(int)/laliga['GamesPlayed'].astype(int))*100

In [27]:
#We are rounding off the percentages to 2 decimal places for better visualization.
laliga['Winning Percent']=laliga['Winning Percent'].round(decimals=2)

In [28]:
#Veryfying the addition of new column to the dataset:
print(laliga)

    Pos              Team  Seasons  Points GamesPlayed GamesWon GamesDrawn  \
0     1       Real Madrid       86    4385        2762     1647        552
1     2         Barcelona       86    4262        2762     1581        573
2     3   Atletico Madrid       80    3442        2614     1241        598
3     4          Valencia       82    3386        2664     1187        616
4     5   Athletic Bilbao       86    3368        2762     1209        633
..  ...               ...      ...     ...         ...      ...        ...
56   57             Xerez        1      34          38        8         10
57   58            Condal        1      22          30        7          8
58   59   Atletico Tetuan        1      19          30        7          5
59   60  Cultural Leonesa        1      14          30        5          4
60   61            Girona        1       0           0        0          0

   GamesLost GoalsFor GoalsAgainst  ... Third Fourth Fifth Sixth   T    Debut  \
0        563     5947         3140  ...     8      8     3     4  79     1929
1        608     5900         3114  ...    12     12     4     6  83     1929
2        775     4534         3309  ...    16      9     7     6  56     1929
3        861     4398         3469  ...    10     11    10     7  50  1931-32
4        920     4631         3700  ...    10      5     8    10  49     1929
..       ...      ...          ...  ...   ...    ...   ...   ...  ..      ...
56        20       38           66  ...     0      0     0     0   0  2009-10
57        15       37           57  ...     0      0     0     0   0  1956-57
58        18       51           85  ...     0      0     0     0   0  1951-52
59        21       34           65  ...     0      0     0     0   0  1955-56
60         0        0            0  ...     0      0     0     0   0  2017-18

   Since/LastApp BestPosition Goal_diff_count  Winning Percent
0           1929            1            2807            59.63
1           1929            1            2786            57.24
2        2002-03            1            1225            47.48
3        1987-88            1             929            44.56
4           1929            1             931            43.77
..           ...          ...             ...              ...
56       2009-10           20             -28            21.05
57       1956-57           16             -20            23.33
58       1951-52           16             -34            23.33
59       1955-56           15             -31            16.67
60       2017-18            9               0              NaN

[61 rows x 22 columns]

In [29]:
#Since last value of the column name 'Winning Percent' is null(NaN) we have to covert it to 0.
laliga['Winning Percent'].fillna(0,inplace = True)
#We also used inplace True to keep the changes to actual dataset.

In [30]:
#Verifying the replacement of NaN values.
print(laliga['Winning Percent'])

0     59.63
1     57.24
2     47.48
3     44.56
4     43.77
      ...
56    21.05
57    23.33
58    23.33
59    16.67
60     0.00
Name: Winning Percent, Length: 61, dtype: float64

In [31]:
#Getting the top 5 teams with highest winning percentage.
laliga[['Team','Winning Percent']].head(5)

              Team  Winning Percent
0      Real Madrid            59.63
1        Barcelona            57.24
2  Atletico Madrid            47.48
3         Valencia            44.56
4  Athletic Bilbao            43.77

### 6.Group teams based on their “Best position” and print the sum of their points for all positions
ex. Best Position  Points                                                                                                                        1  25000                                                                                                                       2  7000

In [32]:
# Creation of a new variable named 'Group_Bestposition' and storing the 3 columns-'Team','Points','BestPosition'
#which are grouped by Bestposition column values
Group_Bestposition = laliga[['Team','Points','BestPosition']].groupby('BestPosition')
print(Group_Bestposition)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002A909011188>

In [33]:
#Compute sum of group values using sum function:
Group_Bestposition.sum()

              Points
BestPosition
1              27933
2               6904
3               5221
4               6563
5               1884
6               2113
7               1186
8               1134
9                 96
10               450
11               445
12               511
14                71
15                14
16                81
17               266
19                81
20                34

In [34]:
#Hence a team scores most points when it ends up at best position of #1
#However,this may not always be correct as team ending up 4th position,
#might have more points sccored compared to team stading at #3